src/exps/fio_benchmarks/paperexps/R-128G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=29032: Thu Sep 27 16:03:06 2018
  write: IOPS=1041, BW=4167KiB/s (4267kB/s)(733MiB/180015msec)
    clat (usec): min=78, max=1026.2k, avg=955.91, stdev=9548.78
     lat (usec): min=79, max=1026.2k, avg=956.38, stdev=9548.80
    clat percentiles (usec):
     |  1.00th=[    93],  5.00th=[   101], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   110],
     | 70.00th=[   112], 80.00th=[   115], 90.00th=[   143], 95.00th=[   159],
     | 99.00th=[ 23200], 99.50th=[ 27132], 99.90th=[156238], 99.95th=[164627],
     | 99.99th=[183501]
   bw (  KiB/s): min=    6, max=11110, per=78.65%, avg=3277.45, stdev=3988.18, samples=358
   iops        : min=    1, max= 2777, avg=819.00, stdev=997.04, samples=358
  lat (usec)   : 100=4.65%, 250=91.84%, 500=1.02%, 750=0.88%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.08%, 20=0.03%, 50=1.00%
  lat (msec)   : 100=0.06%, 250=0.41%, 500=0.01%, 750=0.01%, 2000=0.01%
  cpu          : usr=0.49%, sys=1.48%, ctx=187559, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,187551,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=29294: Thu Sep 27 16:03:06 2018
  write: IOPS=50, BW=203KiB/s (208kB/s)(59.5MiB/300005msec)
    clat (usec): min=90, max=408872, avg=19686.56, stdev=46383.69
     lat (usec): min=90, max=408873, avg=19687.08, stdev=46383.84
    clat percentiles (usec):
     |  1.00th=[   102],  5.00th=[   105], 10.00th=[   106], 20.00th=[   109],
     | 30.00th=[   110], 40.00th=[   111], 50.00th=[   113], 60.00th=[   115],
     | 70.00th=[   127], 80.00th=[   172], 90.00th=[106431], 95.00th=[141558],
     | 99.00th=[170918], 99.50th=[177210], 99.90th=[185598], 99.95th=[189793],
     | 99.99th=[325059]
   bw (  KiB/s): min=    8, max=  712, per=100.00%, avg=203.13, stdev=282.91, samples=600
   iops        : min=    2, max=  178, avg=50.78, stdev=70.72, samples=600
  lat (usec)   : 100=0.53%, 250=81.15%, 500=0.12%, 750=0.01%, 1000=0.05%
  lat (msec)   : 2=0.91%, 10=1.10%, 20=0.18%, 50=0.13%, 100=2.08%
  lat (msec)   : 250=13.72%, 500=0.01%
  cpu          : usr=0.03%, sys=0.12%, ctx=15238, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,15235,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4167KiB/s (4267kB/s), 4167KiB/s-4167KiB/s (4267kB/s-4267kB/s), io=733MiB (768MB), run=180015-180015msec

Run status group 1 (all jobs):
  WRITE: bw=203KiB/s (208kB/s), 203KiB/s-203KiB/s (208kB/s-208kB/s), io=59.5MiB (62.4MB), run=300005-300005msec

Disk stats (read/write):
  sdc: ios=119/202785, merge=0/0, ticks=1326/476154, in_queue=477355, util=99.20%