src/exps/fio_benchmarks/paperexps/R-16G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=25893: Thu Sep 27 15:27:59 2018
  write: IOPS=1077, BW=4311KiB/s (4415kB/s)(758MiB/180037msec)
    clat (usec): min=76, max=863087, avg=923.26, stdev=9776.71
     lat (usec): min=76, max=863087, avg=923.76, stdev=9776.73
    clat percentiles (usec):
     |  1.00th=[    93],  5.00th=[    98], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   108], 40.00th=[   109], 50.00th=[   110], 60.00th=[   111],
     | 70.00th=[   113], 80.00th=[   117], 90.00th=[   145], 95.00th=[   167],
     | 99.00th=[ 23200], 99.50th=[ 28967], 99.90th=[109577], 99.95th=[143655],
     | 99.99th=[287310]
   bw (  KiB/s): min=    6, max= 8840, per=78.70%, avg=3392.85, stdev=3873.32, samples=357
   iops        : min=    1, max= 2210, avg=847.82, stdev=968.37, samples=357
  lat (usec)   : 100=7.17%, 250=89.35%, 500=0.99%, 750=0.81%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.14%, 20=0.05%, 50=0.96%
  lat (msec)   : 100=0.10%, 250=0.37%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.47%, sys=1.84%, ctx=194053, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,194046,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=26164: Thu Sep 27 15:27:59 2018
  write: IOPS=122, BW=492KiB/s (504kB/s)(144MiB/300523msec)
    clat (usec): min=78, max=1063.5k, avg=8127.39, stdev=41676.54
     lat (usec): min=78, max=1063.5k, avg=8127.87, stdev=41676.59
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[   104], 10.00th=[   106], 20.00th=[   108],
     | 30.00th=[   110], 40.00th=[   111], 50.00th=[   112], 60.00th=[   114],
     | 70.00th=[   118], 80.00th=[   143], 90.00th=[   210], 95.00th=[100140],
     | 99.00th=[111674], 99.50th=[156238], 99.90th=[750781], 99.95th=[759170],
     | 99.99th=[868221]
   bw (  KiB/s): min=    8, max= 2168, per=100.00%, avg=521.78, stdev=604.31, samples=567
   iops        : min=    2, max=  542, avg=130.42, stdev=151.05, samples=567
  lat (usec)   : 100=2.05%, 250=88.60%, 500=0.38%, 750=0.20%, 1000=0.07%
  lat (msec)   : 2=0.54%, 4=0.19%, 10=1.16%, 20=0.39%, 50=0.19%
  lat (msec)   : 100=1.44%, 250=4.57%, 500=0.04%, 750=0.10%, 1000=0.09%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.07%, sys=0.24%, ctx=36958, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,36954,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4311KiB/s (4415kB/s), 4311KiB/s-4311KiB/s (4415kB/s-4415kB/s), io=758MiB (795MB), run=180037-180037msec

Run status group 1 (all jobs):
  WRITE: bw=492KiB/s (504kB/s), 492KiB/s-492KiB/s (504kB/s-504kB/s), io=144MiB (151MB), run=300523-300523msec

Disk stats (read/write):
  sdc: ios=84/230999, merge=0/0, ticks=3937/475074, in_queue=479566, util=99.00%